{
  "source_url": "apps_connectors_data-warehouses_snowflake_how-tos_manage-snowflake-tags.html",
  "text": "Manage Snowflake tags | Atlan Documentation\nSkip to main content\nOn this page\nNote that object tagging in Snowflake currently requires\nEnterprise Edition or higher\n.\nAtlan enables you to import your\nSnowflake tags\n, update your Snowflake assets with the imported tags, and push the tag updates back to Snowflake:\nImport tags   -  crawl Snowflake tags from Snowflake to Atlan\nReverse sync   -  sync Snowflake tag updates from Atlan to Snowflake\nOnce you've imported your Snowflake tags to Atlan:\nYour Snowflake assets in Atlan are automatically enriched with their Snowflake tags.\nImported Snowflake tags are mapped to corresponding\nAtlan tags\nthrough case-insensitive name match   -  multiple Snowflake tags can be matched to a single tag in Atlan.\nYou can also\nattach Snowflake tags\n, including tag values, to your Snowflake assets in Atlan   -  allowing you to categorize your assets at a more granular level. Atlan supports:\nAllowed values\n: attach an allowed value from a predefined list of values imported from Snowflake.\nTag values: enter any value in Atlan while\nattaching or editing imported Snowflake tags\non an asset.\nYou can enable reverse sync to push any tag updates for your Snowflake assets back to Snowflake   -  including\nallowed and tag values\nadded to assets in Atlan.\nYou can\nfilter your assets\nby Snowflake tags and tag and allowed values.\nDid you know?\nEnabling reverse sync only updates existing tags in Snowflake. It neither creates nor deletes any tags in Snowflake.\nPrerequisites\n​\nDid you know?\nAdditional privileges are only required when using the\ninformation schema method\nfor fetching metadata. This is because Snowflake\nstores all tag objects\nin the\nACCOUNT_USAGE\nschema. If you're using the\naccount usage method\nto crawl metadata in Atlan or you have\nconfigured the Snowflake miner\n, any permissions required are already set.\nAccount usage method\n​\nBefore you can import tags from Snowflake, you need to do the following:\nCreate tags\nor have existing tags in Snowflake.\nGrant the\nsame permissions\nas required for crawling Snowflake assets to import tags and push updated tags to Snowflake.\nInformation schema method\n​\nBefore you can import tags from Snowflake, you need to do the following:\nCreate tags\nor have existing tags in Snowflake.\nGrant additional permissions to\nimport tags\nfrom Snowflake.\nGrant additional permissions to\npush updated tags\nto Snowflake.\nImport Snowflake tags to Atlan\n​\nWho can do this?\nYou need to be an\nadmin user\nin Atlan to import Snowflake tags to Atlan. You also need to work with your Snowflake administrator to grant\nadditional permissions to import tags\nfrom Snowflake   -  you may not have access yourself.\nYou can import your Snowflake tags to Atlan through one-way tag sync. The synced Snowflake tags are matched to corresponding tags in Atlan through case-insensitive name match and your Snowflake assets are enriched with their synced tags from Snowflake.\nTo import Snowflake tags to Atlan, you can either:\nCreate a new Snowflake workflow and\nconfigure the crawler\nto import tags.\nModify the crawler's configuration\nfor an existing Snowflake workflow to change\nImport Tags\nto\nYes\n. If you subsequently modify the workflow to disable tag import, for any tags already imported, Atlan preserves those tags.\nOnce the crawler has completed running, tags imported from Snowflake are available to use for tagging assets! 🎉\nView Snowflake tags in Atlan\n​\nOnce you've imported your Snowflake tags, you can view and manage your Snowflake tags in Atlan.\nTo view Snowflake tags:\nFrom the left menu of any screen, click\nGovernance\n.\nUnder the\nGovernance\nheading of the _Governance cente_r, click\nTags\n.\n(Optional) Under\nTags\n, click the funnel icon to filter tags by source type. Click\nSnowflake\nto filter for tags imported from Snowflake.\nFrom the left menu under\nTags\n, select a synced tag   -  synced tags display the Snowflake ❄️ icon next to the tag name.\nIn the\nOverview\nsection, you can view a total count of synced Snowflake tags. To the right of\nOverview\n, click\nSynced tags\nto view additional details   -  including tag name, description, tag values, total count of linked assets, connection, database, and schema names, and timestamp for last synced.\n(Optional) Click the\nLinked assets\ntab to view linked assets for your Snowflake tag.\n(Optional) In the top right, click the pencil icon to add a description and change the\ntag icon\n. You can't rename tags synced from Snowflake.\nPush tag updates to Snowflake\n​\nWho can do this?\nAny\nadmin or member user\nin Atlan can configure reverse sync for tag updates to Snowflake. You also need to work with your Snowflake administrator to\ngrant additional permissions to push updates\n-  you may not have access yourself.\nDid you know?\nReverse sync is currently only available for imported Snowflake tags in Atlan. The imported tags display a Snowflake ❄️ icon next to the tag name. If using the\naccount usage method\n, expect a\ndata latency of up to 3 hours\nfor reverse tag sync to be successful.\nYou can enable reverse sync for your imported Snowflake tags in Atlan and push all tag updates for your Snowflake assets back to source. Once you have enabled reverse sync, any Snowflake assets with tags updated in Atlan are also updated in Snowflake.\nTo enable reverse sync for imported Snowflake tags:\nFrom the left menu of any screen, click\nGovernance\n.\nUnder the\nGovernance\nheading of the _Governance cente_r, click\nTags\n.\n(Optional) Under\nTags\n, click the funnel icon to filter tags by source type. Click\nSnowflake\nto filter for tags imported from Snowflake.\nIn the left menu under\nTags\n, select a synced Snowflake tag   -  synced tags display the Snowflake ❄️ icon next to the tag name.\nOn your selected tag page, to the right of\nOverview\n, click\nSynced tags\n.\nUnder\nSynced tags\n, in the upper right, turn on\nEnable reverse sync\nto synchronize tag updates from Atlan to Snowflake.\nIn the advanced settings, you can also enable\nconcatenation\nto support multiple tag values for a single column. For detailed information about multiple tag values and concatenation, see\nMultiple tag values and concatenation\n.\nIn the corresponding confirmation dialog, click\nYes, enable it\nto enable reverse tag sync or click\nCancel\n.\nNow when you\nattach Snowflake tags\nto your Snowflake assets in Atlan, these tag updates are also pushed to Snowflake! 🎉\nDid you know?\nEnabling reverse sync won't trigger any updates in Snowflake until synced tags are attached to Snowflake assets in Atlan. For any questions about managing Snowflake tags, head over\nhere\n.\nPrerequisites\nImport Snowflake tags to Atlan\nView Snowflake tags in Atlan\nPush tag updates to Snowflake",
  "source_type": "docs"
}