{
  "source_url": "apps_connectors_data-warehouses_databricks_how-tos_set-up-an-aws-private-network-link-to-databricks.html",
  "text": "Set up an AWS private network link to Databricks | Atlan Documentation\nSkip to main content\nOn this page\nAWS PrivateLink\ncreates a secure, private connection between services running in AWS. This document describes the steps to set this up between Databricks and Atlan.\nWho can do this?\nYou will need Databricks support, and probably your Databricks administrator involved   -  you may not have access or the tools to run these tasks.\nPrerequisites\n​\nDatabricks must be set up on the E2 version of the platform and Enterprise pricing tier.\nYour Databricks workspace must be in an AWS region that supports the E2 version of the platform, and not the\nus-west-1\nregion. Your Databricks workspace must also be hosted in the same region as Atlan.\nYour Databricks workspace must use customer-managed VPC. (Note that you cannot update an existing Databricks-managed VPC to a customer-managed VPC.)\nFor all details, see\nDatabricks documentation\n.\nNotify Atlan support\n​\nOnce setup is completed,\nprovide Atlan support\nwith the following information:\nThe AWS region of your Databricks instance.\nThere are additional steps that Atlan will need to complete:\nCreating a security group\nCreating an endpoint\nOnce the Atlan team has confirmed that the configuration is ready, please continue with the remaining steps.\nAccept the endpoint connection request\n​\nYou can either:\nAccept the endpoint connection request from Atlan via\nAPI\n.\nAccept the endpoint connection request from Atlan from the\nDatabricks console\n.\nOnce the endpoint connection is accepted, Atlan support will finish the configuration on the Atlan side.\nWhen you use this endpoint in the configuration for\ncrawling Databricks\n, Atlan will connect to Databricks over AWS PrivateLink.\nPrerequisites\nNotify Atlan support\nAccept the endpoint connection request",
  "source_type": "docs"
}