{
  "source_url": "get-started_references_our-3-pro-tips-for-saving-time-with-atlan.html",
  "text": "Our 3 pro tips for saving time with Atlan | Atlan Documentation\nSkip to main content\nOn this page\nThere are a lot of incredibly time-saving functionalities built into Atlan. Here are three pro tips that you can use to save time for you and your team!\nSearch from anywhere in Atlan\nâ\nAtlan supports powerful, intelligent search. Start your search from anywhere in Atlan to find the data asset you're looking for.\nYou can also enter a keyword in the search bar and filter your results by a specific type of asset. For instance, enter the keyword\nproduct\nin the search bar and then click the\nTable\nfilter to view table results for your searched keyword.\nDid you know?\nYou can use\nCmd/Ctrl + K\nto open the search page from\nanywhere\nin Atlan.\nCollaborate with your team\nâ\nUse Atlan's seamless\nSlack\nor\nMicrosoft Teams\nintegration to share updates with your team. Don't waste time adding the correct link   -  just click the\nSlack\nor\nTeams\nicon in Atlan to post directly on a Slack or Microsoft Teams channel. You can also add your message as a resource to the asset.\nRefine your search using filters\nâ\nUse the filters in the left panel of the\nAssets\nworkspace to refine your search. Check out our three best pro tips for using filters!\nSearch by certification status\nâ\nCertificates\nin Atlan are a useful tool for letting your team know the status of an asset. You can search by certification status to only find the assets you need.\nSearch by owners or data contributors\nâ\nWant to find out what your teammate is working on? Looking for a dashboard that your manager is delegating to you? Use the\nOwners\nfilter to search by asset\nowner\nin Atlan.\nYou can also search by other user roles. To do this, you first need to\nset up custom metadata\nproperties to represent those other roles. Then you can filter by those custom metadata properties to find assets with any Atlan user who has that role for the asset.\nSearch by lineage\nâ\nWant to only find assets with a completed\nlineage\n? You can filter your search by assets that have data lineage using the\nHas lineage\nfilter listed under\nProperties\n.Â\nTry using these 3 pro tips to make Atlan a powerful part of your team's tool kit.\nSearch from anywhere in Atlan\nCollaborate with your team\nRefine your search using filters",
  "source_type": "docs"
}