{
  "source_url": "models_entities_sisensedatamodel.html",
  "text": "SisenseDatamodel - Developer\nSkip to content\nSisenseDatamodel\n¶\nInstance of a Sisense datamodel in Atlan. These group tables together that you can use to build dashboards.\nComplete reference\nThis is a complete reference for the\nSisenseDatamodel\nobject in Atlan, showing every possible property and relationship that can exist for these objects. For an introduction, you probably want to start with:\nSnippets\n— small, atomic examples of single-step use cases.\nPatterns\n— walkthroughs of common multi-step implementation patterns.\nSisenseDatamodel\ninherits its attributes and relationships from these other types:\nclassDiagram\ndirection RL\nclass SisenseDatamodel\nlink SisenseDatamodel \"../sisensedatamodel\"\nclass Sisense {\n<<abstract>>\n}\nlink Sisense \"../sisense\"\nSisense <|-- SisenseDatamodel : extends\nclass BI {\n<<abstract>>\n}\nlink BI \"../bi\"\nBI <|-- Sisense : extends\nclass Catalog {\n<<abstract>>\n}\nlink Catalog \"../catalog\"\nCatalog <|-- BI : extends\nclass Asset {\n<<abstract>>\n}\nlink Asset \"../asset\"\nAsset <|-- Catalog : extends\nclass Referenceable {\n<<abstract>>\n}\nlink Referenceable \"../referenceable\"\nReferenceable <|-- Asset : extends\nProperties\n¶\nInherited properties\nThese attributes are inherited from\nSisenseDatamodel\n's supertypes (shown above):\ntypeName\n¶\nType of this asset.\nguid\n¶\nGlobally-unique identifier for this asset.\nclassifications\n¶\nTags assigned to the asset. (1)\nUses a different name in SDKs\natlanTags\natlan_tags\nFor more information, see the\ntag assets\nsnippets.\nbusinessAttributes\n¶\nMap of custom metadata attributes and values defined on the asset. (1)\nUses a different name in SDKs\ncustomMetadataSets\ncustom_metadata\nFor more information, see the\nchange custom metadata\nsnippets.\nstatus\n¶\nStatus of the asset. (1)\nTreat as read-only\nYou should not try to\nset\nstatus\non an asset. Instead, see the asset CRUD snippets on\ndeleting\nand\nrestoring\nassets.\ncreatedBy\n¶\nUser or account that created the asset.\nupdatedBy\n¶\nUser or account that last updated the asset.\ncreateTime\n¶\nTime (epoch) at which the asset was created, in milliseconds.\nupdateTime\n¶\nTime (epoch) at which the asset was last updated, in milliseconds.\ndeleteHandler\n¶\nDetails on the handler used for deletion of the asset. (1)\nTreat as read-only\nYou should not try to\nset\ndeleteHandler\non an asset. Instead, see the asset CRUD snippets on\ndeleting\nassets.\nclassificationNames\n¶\nHashed-string names of the Atlan tags that exist on the asset. (1)\nUses a different name in SDKs\natlanTagNames\natlan_tag_names\nUse\nclassifications\nto make changes to tags.\nisIncomplete\n¶\nUnused.\nmeaningNames\n¶\nHuman-readable names of terms that have been linked to this asset.\nmeanings\n¶\nDetails of terms that have been linked to this asset. (1)\nDo not use\nThese should not be used, as they can be inconsistent. Instead, see the\nlink terms and assets\nsnippets.\npendingTasks\n¶\nUnique identifiers (GUIDs) for any background tasks that are yet to operate on this asset.\nqualifiedName\n¶\nUnique name for this asset. This is typically a concatenation of the asset's name onto its parent's qualifiedName. This must be unique across all assets of the same type.\nadminGroups\n¶\nList of groups who administer this asset. (This is only used for certain asset types.)\nadminRoles\n¶\nList of roles who administer this asset. (This is only used for Connection assets.)\nadminUsers\n¶\nList of users who administer this asset. (This is only used for certain asset types.)\nannouncementMessage\n¶\nDetailed message to include in the announcement on this asset.\nannouncementTitle\n¶\nBrief title for the announcement on this asset. Required when announcementType is specified.\nannouncementType\n¶\nType of announcement on this asset.\nannouncementUpdatedAt\n¶\nTime (epoch) at which the announcement was last updated, in milliseconds.\nannouncementUpdatedBy\n¶\nName of the user who last updated the announcement.\napplicationFieldQualifiedName\n¶\nQualified name of the ApplicationField that contains this asset.\napplicationQualifiedName\n¶\nQualified name of the Application that contains this asset.\nassetAnomaloAppliedCheckTypes\n¶\nAll associated Anomalo check types.\nassetAnomaloCheckCount\n¶\nTotal number of checks present in Anomalo for this asset.\nassetAnomaloCheckStatuses\n¶\nStringified JSON object containing status of all Anomalo checks associated to this asset.\nassetAnomaloDQStatus\n¶\nStatus of data quality from Anomalo.\nassetAnomaloFailedCheckCount\n¶\nTotal number of checks failed in Anomalo for this asset.\nassetAnomaloFailedCheckTypes\n¶\nAll associated Anomalo failed check types.\nassetAnomaloLastCheckRunAt\n¶\nTime (epoch) at which the last check was run via Anomalo.\nassetAnomaloSourceUrl\n¶\nURL of the source in Anomalo.\nassetCoverImage\n¶\nTBC\nassetDbtAccountName\n¶\nName of the account in which this asset exists in dbt.\nassetDbtAlias\n¶\nAlias of this asset in dbt.\nassetDbtEnvironmentDbtVersion\n¶\nVersion of the environment in which this asset is materialized in dbt.\nassetDbtEnvironmentName\n¶\nName of the environment in which this asset is materialized in dbt.\nassetDbtJobLastRun\n¶\nTime (epoch) at which the job that materialized this asset in dbt last ran, in milliseconds.\nassetDbtJobLastRunArtifactS3Path\n¶\nPath in S3 to the artifacts saved from the last run of the job that materialized this asset in dbt.\nassetDbtJobLastRunArtifactsSaved\n¶\nWhether artifacts were saved from the last run of the job that materialized this asset in dbt (true) or not (false).\nassetDbtJobLastRunCreatedAt\n¶\nTime (epoch) at which the job that materialized this asset in dbt was last created, in milliseconds.\nassetDbtJobLastRunDequedAt\n¶\nTime (epoch) at which the job that materialized this asset in dbt was dequeued, in milliseconds.\nassetDbtJobLastRunExecutedByThreadId\n¶\nThread ID of the user who executed the last run of the job that materialized this asset in dbt.\nassetDbtJobLastRunGitBranch\n¶\nBranch in git from which the last run of the job that materialized this asset in dbt ran.\nassetDbtJobLastRunGitSha\n¶\nSHA hash in git for the last run of the job that materialized this asset in dbt.\nassetDbtJobLastRunHasDocsGenerated\n¶\nWhether docs were generated from the last run of the job that materialized this asset in dbt (true) or not (false).\nassetDbtJobLastRunHasSourcesGenerated\n¶\nWhether sources were generated from the last run of the job that materialized this asset in dbt (true) or not (false).\nassetDbtJobLastRunNotificationsSent\n¶\nWhether notifications were sent from the last run of the job that materialized this asset in dbt (true) or not (false).\nassetDbtJobLastRunOwnerThreadId\n¶\nThread ID of the owner of the last run of the job that materialized this asset in dbt.\nassetDbtJobLastRunQueuedDuration\n¶\nTotal duration the job that materialized this asset in dbt spent being queued.\nassetDbtJobLastRunQueuedDurationHumanized\n¶\nHuman-readable total duration of the last run of the job that materialized this asset in dbt spend being queued.\nassetDbtJobLastRunRunDuration\n¶\nRun duration of the last run of the job that materialized this asset in dbt.\nassetDbtJobLastRunRunDurationHumanized\n¶\nHuman-readable run duration of the last run of the job that materialized this asset in dbt.\nassetDbtJobLastRunStartedAt\n¶\nTime (epoch) at which the job that materialized this asset in dbt was started running, in milliseconds.\nassetDbtJobLastRunStatusMessage\n¶\nStatus message of the last run of the job that materialized this asset in dbt.\nassetDbtJobLastRunTotalDuration\n¶\nTotal duration of the last run of the job that materialized this asset in dbt.\nassetDbtJobLastRunTotalDurationHumanized\n¶\nHuman-readable total duration of the last run of the job that materialized this asset in dbt.\nassetDbtJobLastRunUpdatedAt\n¶\nTime (epoch) at which the job that materialized this asset in dbt was last updated, in milliseconds.\nassetDbtJobLastRunUrl\n¶\nURL of the last run of the job that materialized this asset in dbt.\nassetDbtJobName\n¶\nName of the job that materialized this asset in dbt.\nassetDbtJobNextRun\n¶\nTime (epoch) when the next run of the job that materializes this asset in dbt is scheduled.\nassetDbtJobNextRunHumanized\n¶\nHuman-readable time when the next run of the job that materializes this asset in dbt is scheduled.\nassetDbtJobSchedule\n¶\nSchedule of the job that materialized this asset in dbt.\nassetDbtJobScheduleCronHumanized\n¶\nHuman-readable cron schedule of the job that materialized this asset in dbt.\nassetDbtJobStatus\n¶\nStatus of the job that materialized this asset in dbt.\nassetDbtMeta\n¶\nMetadata for this asset in dbt, specifically everything under the 'meta' key in the dbt object.\nassetDbtPackageName\n¶\nName of the package in which this asset exists in dbt.\nassetDbtProjectName\n¶\nName of the project in which this asset exists in dbt.\nassetDbtSemanticLayerProxyUrl\n¶\nURL of the semantic layer proxy for this asset in dbt.\nassetDbtSourceFreshnessCriteria\n¶\nFreshness criteria for the source of this asset in dbt.\nassetDbtTags\n¶\nList of tags attached to this asset in dbt.\nassetDbtTestStatus\n¶\nAll associated dbt test statuses.\nassetDbtUniqueId\n¶\nUnique identifier of this asset in dbt.\nassetDbtWorkflowLastUpdated\n¶\nName of the DBT workflow in Atlan that last updated the asset.\nassetIcon\n¶\nName of the icon to use for this asset. (Only applies to glossaries, currently.)\nassetMcAlertQualifiedNames\n¶\nList of unique Monte Carlo alert names attached to this asset.\nassetMcIncidentNames\n¶\nList of Monte Carlo incident names attached to this asset.\nassetMcIncidentPriorities\n¶\nList of Monte Carlo incident priorities associated with this asset.\nassetMcIncidentQualifiedNames\n¶\nList of unique Monte Carlo incident names attached to this asset.\nassetMcIncidentSeverities\n¶\nList of Monte Carlo incident severities associated with this asset.\nassetMcIncidentStates\n¶\nList of Monte Carlo incident states associated with this asset.\nassetMcIncidentSubTypes\n¶\nList of Monte Carlo incident sub-types associated with this asset.\nassetMcIncidentTypes\n¶\nList of Monte Carlo incident types associated with this asset.\nassetMcIsMonitored\n¶\nTracks whether this asset is monitored by MC or not\nassetMcLastSyncRunAt\n¶\nTime (epoch) at which this asset was last synced from Monte Carlo.\nassetMcMonitorNames\n¶\nList of Monte Carlo monitor names attached to this asset.\nassetMcMonitorQualifiedNames\n¶\nList of unique Monte Carlo monitor names attached to this asset.\nassetMcMonitorScheduleTypes\n¶\nSchedules of all associated Monte Carlo monitors.\nassetMcMonitorStatuses\n¶\nStatuses of all associated Monte Carlo monitors.\nassetMcMonitorTypes\n¶\nTypes of all associated Monte Carlo monitors.\nassetPoliciesCount\n¶\nCount of policies inside the asset\nassetPolicyGUIDs\n¶\nArray of policy ids governing this asset\nassetSodaCheckCount\n¶\nNumber of checks done via Soda.\nassetSodaCheckStatuses\n¶\nAll associated Soda check statuses.\nassetSodaDQStatus\n¶\nStatus of data quality from Soda.\nassetSodaLastScanAt\n¶\nTBC\nassetSodaLastSyncRunAt\n¶\nTBC\nassetSodaSourceURL\n¶\nTBC\nassetTags\n¶\nList of tags attached to this asset.\nassetThemeHex\n¶\nColor (in hexadecimal RGB) to use to represent this asset.\ncertificateStatus\n¶\nStatus of this asset's certification.\ncertificateStatusMessage\n¶\nHuman-readable descriptive message used to provide further detail to certificateStatus.\ncertificateUpdatedAt\n¶\nTime (epoch) at which the certification was last updated, in milliseconds.\ncertificateUpdatedBy\n¶\nName of the user who last updated the certification of this asset.\nconnectionName\n¶\nSimple name of the connection through which this asset is accessible.\nconnectionQualifiedName\n¶\nUnique name of the connection through which this asset is accessible.\nconnectorName\n¶\nType of the connector through which this asset is accessible. (1)\nUses a different name in SDKs\nconnectorType\nconnector_type\ndbtQualifiedName\n¶\nUnique name of this asset in dbt.\ndescription\n¶\nDescription of this asset, for example as crawled from a source. Fallback for display purposes, if userDescription is empty.\ndisplayName\n¶\nHuman-readable name of this asset used for display purposes (in user interface).\ndomainGUIDs\n¶\nArray of domain guids linked to this asset\nhasContract\n¶\nWhether this asset has contract (true) or not (false).\n__hasLineage\n¶\nWhether this asset has lineage (true) or not (false). (1)\nUses a different name in SDKs\nhasLineage\nhas_lineage\nisAIGenerated\n¶\nTBC\nisDiscoverable\n¶\nWhether this asset is discoverable through the UI (true) or not (false).\nisEditable\n¶\nWhether this asset can be edited in the UI (true) or not (false).\nisPartial\n¶\nTBC\nlastRowChangedAt\n¶\nTime (epoch) of the last operation that inserted, updated, or deleted rows, in milliseconds.\nlastSyncRun\n¶\nName of the last run of the crawler that last synchronized this asset.\nlastSyncRunAt\n¶\nTime (epoch) at which this asset was last crawled, in milliseconds.\nlastSyncWorkflowName\n¶\nName of the crawler that last synchronized this asset.\nlexicographicalSortOrder\n¶\nCustom order for sorting purpose, managed by client\nname\n¶\nName of this asset. Fallback for display purposes, if displayName is empty.\nnonCompliantAssetPolicyGUIDs\n¶\nArray of policy ids non-compliant to this asset\nownerGroups\n¶\nList of groups who own this asset.\nownerUsers\n¶\nList of users who own this asset.\npopularityScore\n¶\nPopularity score for this asset.\nsampleDataUrl\n¶\nURL for sample data for this asset.\nsourceCostUnit\n¶\nThe unit of measure for sourceTotalCost.\nsourceCreatedAt\n¶\nTime (epoch) at which this asset was created in the source system, in milliseconds.\nsourceCreatedBy\n¶\nName of the user who created this asset, in the source system.\nsourceEmbedURL\n¶\nURL to create an embed for a resource (for example, an image of a dashboard) within Atlan.\nsourceLastReadAt\n¶\nTimestamp of most recent read operation.\nsourceOwners\n¶\nList of owners of this asset, in the source system.\nsourceQueryComputeCostRecordList\n¶\nList of most expensive warehouses with extra insights. (1)\nUses a different name in SDKs\nsourceQueryComputeCostRecords\nsource_query_compute_cost_records\nsourceQueryComputeCostList\n¶\nList of most expensive warehouse names. (1)\nUses a different name in SDKs\nsourceQueryComputeCosts\nsource_query_compute_costs\nsourceReadCount\n¶\nTotal count of all read operations at source.\nsourceReadExpensiveQueryRecordList\n¶\nList of the most expensive queries that accessed this asset. (1)\nUses a different name in SDKs\nsourceReadExpensiveQueryRecords\nsource_read_expensive_query_records\nsourceReadPopularQueryRecordList\n¶\nList of the most popular queries that accessed this asset. (1)\nUses a different name in SDKs\nsourceReadPopularQueryRecords\nsource_read_popular_query_records\nsourceReadQueryCost\n¶\nTotal cost of read queries at source.\nsourceReadRecentUserRecordList\n¶\nList of usernames with extra insights for the most recent users who read this asset. (1)\nUses a different name in SDKs\nsourceReadRecentUserRecords\nsource_read_recent_user_records\nsourceReadRecentUserList\n¶\nList of usernames of the most recent users who read this asset. (1)\nUses a different name in SDKs\nsourceReadRecentUsers\nsource_read_recent_users\nsourceReadSlowQueryRecordList\n¶\nList of the slowest queries that accessed this asset. (1)\nUses a different name in SDKs\nsourceReadSlowQueryRecords\nsource_read_slow_query_records\nsourceReadTopUserRecordList\n¶\nList of usernames with extra insights for the users who read this asset the most. (1)\nUses a different name in SDKs\nsourceReadTopUserRecords\nsource_read_top_user_records\nsourceReadTopUserList\n¶\nList of usernames of the users who read this asset the most. (1)\nUses a different name in SDKs\nsourceReadTopUsers\nsource_read_top_users\nsourceReadUserCount\n¶\nTotal number of unique users that read data from asset.\nsourceTotalCost\n¶\nTotal cost of all operations at source.\nsourceURL\n¶\nURL to the resource within the source application, used to create a button to view this asset in the source application.\nsourceUpdatedAt\n¶\nTime (epoch) at which this asset was last updated in the source system, in milliseconds.\nsourceUpdatedBy\n¶\nName of the user who last updated this asset, in the source system.\nstarredBy\n¶\nUsers who have starred this asset.\nstarredCount\n¶\nNumber of users who have starred this asset.\nstarredDetailsList\n¶\nList of usernames with extra information of the users who have starred an asset. (1)\nUses a different name in SDKs\nstarredDetails\nstarred_details\nsubType\n¶\nSubtype of this asset.\ntenantId\n¶\nName of the Atlan workspace in which this asset exists.\nuserDescription\n¶\nDescription of this asset, as provided by a user. If present, this will be used for the description in user interface.\nviewScore\n¶\nView score for this asset.\nviewerGroups\n¶\nList of groups who can view assets contained in a collection. (This is only used for certain asset types.)\nviewerUsers\n¶\nList of users who can view assets contained in a collection. (This is only used for certain asset types.)\nThese attributes are specific to instances of\nSisenseDatamodel\n(and all of its subtypes).\nsisenseDatamodelLastBuildTime\n¶\nTime (epoch) when this datamodel was last built, in milliseconds.\nsisenseDatamodelLastPublishTime\n¶\nTime (epoch) when this datamodel was last published, in milliseconds.\nsisenseDatamodelLastSuccessfulBuildTime\n¶\nTime (epoch) when this datamodel was last built successfully, in milliseconds.\nsisenseDatamodelRelationType\n¶\nDefault relation type for this datamodel. 'extract' type Datamodels have regular relations by default. 'live' type Datamodels have direct relations by default.\nsisenseDatamodelRevision\n¶\nRevision of this datamodel.\nsisenseDatamodelServer\n¶\nHostname of the server on which this datamodel was created.\nsisenseDatamodelTableCount\n¶\nNumber of tables in this datamodel.\nsisenseDatamodelType\n¶\nType of this datamodel, for example: 'extract' or 'custom'.\nRelationships\n¶\nInherited relationships\nThese relationships are inherited from\nSisenseDatamodel\n's supertypes:\nanomaloChecks\n(\nAnomaloCheck\n)\n¶\nChecks that run on this asset.\napplication\n(\nApplication\n)\n¶\nApplication asset containing this Asset.\napplicationField\n(\nApplicationField\n)\n¶\nApplicationField asset containing this Asset.\nmeanings\n(\nAtlasGlossaryTerm\n)\n¶\nGlossary terms that are linked to this asset. (1)\nUses a different name in SDKs\nassignedTerms\nassigned_terms\ndataContractLatest\n(\nDataContract\n)\n¶\nLatest version of the data contract (in any status) for this asset.\ndataContractLatestCertified\n(\nDataContract\n)\n¶\nLatest certified version of the data contract for this asset.\nfiles\n(\nFile\n)\n¶\nTBC\ninputPortDataProducts\n(\nDataProduct\n)\n¶\nData products for which this asset is an input port.\nlinks\n(\nLink\n)\n¶\nLinks that are attached to this asset.\nmcIncidents\n(\nMCIncident\n)\n¶\nTBC\nmcMonitors\n(\nMCMonitor\n)\n¶\nMonitors that observe this asset.\nmetrics\n(\nMetric\n)\n¶\nTBC\noutputPortDataProducts\n(\nDataProduct\n)\n¶\nData products for which this asset is an output port.\nreadme\n(\nReadme\n)\n¶\nREADME that is linked to this asset.\nschemaRegistrySubjects\n(\nSchemaRegistrySubject\n)\n¶\nTBC\nsodaChecks\n(\nSodaCheck\n)\n¶\nTBC\nuserDefRelationshipFrom\n(\nReferenceable\n)\n¶\nTBC (1)\nUses a different name in SDKs\nuserDefRelationshipFroms\nuser_def_relationship_froms\nuserDefRelationshipTo\n(\nReferenceable\n)\n¶\nTBC (1)\nUses a different name in SDKs\nuserDefRelationshipTos\nuser_def_relationship_tos\ninputToAirflowTasks\n(\nAirflowTask\n)\n¶\nTasks to which this asset provides input.\ninputToProcesses\n(\nProcess\n)\n¶\nProcesses to which this asset provides input.\ninputToSparkJobs\n(\nSparkJob\n)\n¶\nTBC\nmodelImplementedAttributes\n(\nModelAttribute\n)\n¶\nAttributes implemented by this asset.\nmodelImplementedEntities\n(\nModelEntity\n)\n¶\nEntities implemented by this asset.\noutputFromAirflowTasks\n(\nAirflowTask\n)\n¶\nTasks from which this asset is output.\noutputFromProcesses\n(\nProcess\n)\n¶\nProcesses from which this asset is produced as output.\noutputFromSparkJobs\n(\nSparkJob\n)\n¶\nTBC\nThese relationships are specific to instances of\nSisenseDatamodel\n(and all of its subtypes).\nsisenseDashboards\n(\nSisenseDashboard\n)\n¶\nTBC\nsisenseDatamodelTables\n(\nSisenseDatamodelTable\n)\n¶\nDatamodel tables that exist within this datamodel.\n2023-01-04\n2023-12-29\nWas this page helpful?\nThanks for your feedback!\nThanks for your feedback! Help us improve this page by using our\nfeedback form\nto provide us with more information.\nBack to top\nCookie consent\nWe use cookies to:\nAnonymously measure page views, and\nAllow you to give us one-click feedback on any page.\nWe do\nnot\ncollect or store:\nAny personally identifiable information.\nAny information for any (re)marketing purposes.\nWith your consent, you're helping us to make our documentation better 💙\nGoogle Analytics\nAccept\nReject\nManage settings",
  "source_type": "sdk"
}