{
  "source_url": "platform_references_cloud-logging-and-monitoring.html",
  "text": "Cloud logging and monitoring | Atlan Documentation\nSkip to main content\nOn this page\nAtlan exports IAM service event logs in the OpenTelemetry Protocol (OTLP) specification and securely delivers them to the Amazon S3 or Google Cloud Storage (GCS) bucket of your organization. This enables you to monitor login events and integrate logs with security information and event management (SIEM) systems for real-time security monitoring and alerts.\nKey aspects\n​\nLog format and structure: The OTLP format ensures seamless integration with SIEM systems, and logs are organized by date and event type. Logs are stored in a compressed format in your organization's preferred object storage (S3 or GCS). Once uncompressed, the logs will be available in a JSON file format containing multiple log entries.\nEach file is saved for an hour in the following folder structure in gzip:\n/year=YYYY/month=MM/day=DD/hour=HH/logs_<rnd-9-digit-int>.json.gz\nThe JSON file structure is as follows:\n{\n\"resourceLogs\"\n:\n[\n{\n\"resource\"\n:\n{\n\"attributes\"\n:\n[\n// k8s metadata\n]\n}\n,\n\"scopeLogs\"\n:\n[\n{\n\"scope\"\n:\n{\n}\n,\n\"logRecords\"\n:\n[\n{\n\"timeUnixNano\"\n:\n\"1725861538220747913\"\n,\n\"observedTimeUnixNano\"\n:\n\"1726071786185095727\"\n,\n\"body\"\n:\n{\n\"stringValue\"\n:\n\"//redacted logline\"\n}\n,\n\"traceId\"\n:\n\"\"\n,\n\"spanId\"\n:\n\"\"\n}\n]\n}\n,\n{\n...\n}\n,\n]\n}\n,\n{\n\"resource\"\n:\n{\n...\n}\n,\n\"scopeLogs\"\n:\n[\n...\n]\n}\n]\n}\nSecure delivery- Logs are encrypted in transit and at rest, with mechanisms to validate data integrity.\nCustomer access: Logs are easily accessible through S3 or GCS, allowing for a flexible monitoring and alerting setup.\nEnabling event logs in AWS\n​\nPrerequisites\n​\nEnable bucket versioning. Both source and destination buckets must have versioning enabled. See\nAWS documentation\n.\nCustomer-provided bucket details: account ID, bucket name, and region.\nAtlan will use these details to create an IAM role on the Atlan side and then provide you with the bucket policy to be attached.\nOnce you have confirmed that the bucket policy has been attached, Atlan will complete the final step of setting up log replication. Atlan support will complete the configuration on the Atlan side.\nYou will need to attach the following policy to your destination bucket:\n{\n\"Version\"\n:\n\"2012-10-17\"\n,\n\"Id\"\n:\n\"\"\n,\n\"Statement\"\n:\n[\n{\n\"Sid\"\n:\n\"Set-permissions-for-objects\"\n,\n\"Effect\"\n:\n\"Allow\"\n,\n\"Principal\"\n:\n{\n\"AWS\"\n:\n\"<Atlan Role ARN>\"\n}\n,\n\"Action\"\n:\n[\n\"s3:ReplicateObject\"\n,\n\"s3:ReplicateDelete\"\n,\n\"s3:GetBucketVersioning\"\n,\n\"s3:PutBucketVersioning\"\n]\n,\n\"Resource\"\n:\n[\n\"arn:aws:s3:::<Customer S3 Bucket Name>/*\"\n,\n\"arn:aws:s3:::<Customer S3 Bucket Name>\"\n]\n}\n]\n}\nContinuous replication to S3 bucket\n​\nApplication audit logs are streamed to Atlan's S3 bucket in near real time — within 10 seconds of being generated. This is a continuous process. Once the logs are available in Atlan's bucket, the logs will be replicated to your organization's S3 bucket within 15 minutes. The replication is ongoing and occurs without delays. This ensures that logs are continuously transferred as they are generated, with no waiting period between replications.\nEnabling event logs in GCP\n​\nFor Google Cloud Platform (GCP), Atlan utilizes\nLogs Router\nto transfer logs from the GCS bucket of your Atlan tenant to a destination bucket of your choice. The destination must be supported by the Logs Router.\nThe organization must provide details of the destination where the logs should be synced. This destination must be supported by the Logs Router.\nAtlan will create a Log Router sink and provide you with a service account.\nDepending on the selected destination, you will need to configure the necessary permissions for the service account as outlined in\nGoogle documentation\n.\nOnce you have configured the permissions, the logs will begin syncing to your preferred destination.\nNew sinks to Cloud Storage buckets may take several hours to start routing log entries. Sinks to Cloud Storage are processed hourly while other destination types are processed in real time.\nKey aspects\nEnabling event logs in AWS\nEnabling event logs in GCP",
  "source_type": "docs"
}