{
  "source_url": "platform_concepts_authentication-and-authorization.html",
  "text": "Authentication and authorization | Atlan Documentation\nSkip to main content\nOn this page\nAtlan supports the following authentication methods:\nBasic authentication\n​\nAtlan initially comes with basic or username-password authentication. Admins can\ninvite new users\nto log into Atlan. When a new user opens the invitation link, they will be able to set up their user profile, including username and password.\nHowever, Atlan does not recommend using basic authentication. Instead, admins should configure and enforce\nSSO authentication\n.\nSSO authentication\n​\nSSO using SAML 2.0\n​\nAtlan supports single sign-on (SSO), allowing admins to configure SSO authentication.\nAtlan currently supports the following SSO providers:\nAzure AD\nGoogle\nJumpCloud\nOkta\nOneLogin\nCustom IdP\nSSO using SCIM\n​\nSystem for Cross-domain Identity Management (SCIM) provisioning\nworks in combination with SSO. Atlan currently supports SCIM provisioning for the following SSO providers:\nAzure AD\nOkta\nAuthorization\n​\nRole-based access control (RBAC)\n​\nAtlan implements role-based access control (RBAC) to ensure that users have the minimum level of access required to perform their tasks. Access rights are assigned based on roles, and users are granted permissions according to their responsibilities. A system owner or an authorized party must approve any additional permissions.\nAtlan adheres to the principle of least privilege, ensuring that users are only granted the level of access necessary to perform their job functions.\nUser access review (UAR)\n​\nAtlan recommends that admins perform access reviews of users, admins, and service accounts on a quarterly basis to ensure that appropriate access levels are maintained. Access reviews should also be documented.\nIdentity and access management\n​\nFor centralized management of groups and users, Atlan uses granular\naccess policies\n.\nAdmins can define policies to control both which actions a user can take and against which assets. These can be as broad as entire databases down to individual columns. Organizations can even build policies based on asset classification. This opens up the ability to restrict access to sensitive data like Personally Identifiable Information (PII)   -  an essential feature in the GDPR era.\nAtlan\ndenies access by default\n, and\nexplicit denials override any grants\n. You can even deny admin users access to assets, if you want.\nRoles\n​\nYou must assign every user in Atlan a\nuser role\n. These control basic levels of access.\nGroups\n​\nYou can also add users to\ngroups\n. Groups provide a more maintainable mechanism for applying access controls.\nPolicies\n​\nYou can define\naccess policies\nfor both users and groups.\nThrough these policies you can restrict which users can take which actions on which assets.\nFor example, you can set up\ntags\nsuch as PII and apply this to data assets like tables. You can also configure the tag to propagate downstream to any columns or tables created from them.\nYou can then define\naccess controls based on these tags\nto restrict access to tagged assets. If Atlan propagates tags for you to derived assets, the access control is automatically applied to those derived assets as well.\nBasic authentication\nSSO authentication\nAuthorization\nIdentity and access management",
  "source_type": "docs"
}