{
  "source_url": "platform_references_atlan-architecture.html",
  "text": "Atlan architecture | Atlan Documentation\nSkip to main content\nOn this page\nAtlan is a cloud-first solution. Single-tenant SaaS is the recommended deployment model. Atlan currently supports hosting tenants on the following cloud platforms:\nAmazon Web Services (AWS)\n​\nMicrosoft Azure\n​\nGoogle Cloud Platform (GCP)\n​\nThe components of Atlan are isolated, across both compute and data. For more details, see\nHow are resources isolated?\nPlatform components\n​\nKong\nis an API gateway. It handles rate limiting and token verification on all incoming API requests.\nApache Keycloak\nis an identity and access management component. It manages everything to do with users, login, SSO and so on.\nHeracles is Atlan's API service. It houses the business logic used by the frontend and APIs to interact with other platform components.\nPostgreSQL\nis a SQL database. Many services on the platform use it for storage.\nHashiCorp Vault\nis a secret manager. It stores sensitive credentials provided by the user.\nApache Ranger\nis the policy engine. It provides fine-grained access control over data in the metastore.\nArgo Workflows\nis a workflow orchestrator for k8s. It runs and manages long-running jobs in a container and k8s-native fashion.\nAdmission Controller is a k8s admission controller. It performs certain actions when Argo Workflows are updated such as workflow alerts.\nMetastore stores metadata as data in a graph store. It is based on\nApache Atlas\nand has fine-grained access control on top.\nApache Zookeeper\nmanages consensus and coordination for the metastore services.\nElasticsearch\nindexes data and drives search functionality.\nApache Cassandra\nis an object-oriented database used to store the metastore's data.\nApache Kafka\nis an event stream. It enables event-driven use cases across the platform.\nHeka is Atlan's SQL component. It parses, rewrites and optimizes SQL queries and is powered by\nApache Calcite\n.\nRedis\nis a cache layer used by Heracles.\nPlatform management components\n​\nVelero\nperforms cluster backups.\nKibana\nexplores and filters log data stored in Elasticsearch.\nFluent Bit\nis a logging and metrics processor. It parses and pushes logs from pods to various destinations.\nElasticsearch\nstores and indexes logs.\nCentral components\n​\nZenduty\nis used for incident response. Alerts are sent when something goes wrong in one of the clusters.\nArgo CD\nis used for continuous deployment. Changes in git repositories lead to upgrades in the clusters.\nGithub Actions\nupdate the Docker container images as part of the development process.\nSendgrid\nis used to send emails.\nThe frontend is a\nVue.js\nweb application that's hosted on S3 and delivered via\nAmazon CloudFront\ncontent delivery network (CDN) service.\nAlertmanager\nsends alerts generated by metrics stored in Prometheus.\nGrafana\nprovides observability dashboards.\nVictoriaMetrics\nis a fast, cost-effective, and scalable monitoring solution and time series database. It processes high volumes of data and enables long-term storing.\nAtlan marketplace\n(not pictured)\n​\nThe marketplace offers packages (workflows) that perform long-running tasks on the Atlan platform. The ecosystem enables the creation of metadata and lineage connectors.\nSee\nsecurity.atlan.com\nfor the latest policies and standards, reports and certifications, architecture, diagrams and more.\nPlatform components\nPlatform management components\nCentral components\nAtlan marketplace (not pictured)",
  "source_type": "docs"
}