{
  "source_url": "product_capabilities_discovery_how-tos_search-and-discover-assets.html",
  "text": "Search and discover assets | Atlan Documentation\nSkip to main content\nOn this page\nAtlan is a living catalog of all your data assets and knowledge. It lets you quickly discover and access your data, along with the tribal knowledge and business context.\nIts Amazon-like search and\nfiltering experience\nisn't just for data tables. It also extends to a variety of data assets, like columns, databases, SQL queries, BI dashboards, and much more.\nTo ensure a high-quality search experience, Atlan recommends the following:\nCertify your assets\nLink terms to your assets\nto add business context\nEnrich your assets with descriptions\nStar your assets\nfor easy access\nDid you know?\nYou can bookmark your\nsearch results with applied filters\nor share them with other Atlan users in your organization for quick and easy access.\nSearch superpowers\nâ\nLet's find out what makes Atlan's search intuitive and super quick.\nIntelligent keyword recognition\nAtlan supports powerful, intelligent search.Â When you search using keywords, the keywords in the matching search results will be highlighted for easy recognition. Even if your keyword contains an underscore\n_\nor a period\n.\n-  for example,\ninstacart_order\n-  both keywords will be highlighted across all search results.\nFor keyword-based search:\nIf the keywords you're searching by is present in the asset name,\ndescription\n, or\nlinked term\n, only then will the asset appear in your search results.Â\nAtlan displays search results based on asset names   -  technical name and\nalias\n-  that match your keyword(s).\nIf the keyword is a\nglossary term linked to assets\nor present in\nasset descriptions\n, such assets will be boosted in search results.\nWhether your search query is incomplete (\ninsta\n) or misspelled (\ninstacrt ordr\n), Atlan's powerful search can still help you discover exactly what you need.\nSearch from anywhere\nâ\nThere are multiple ways to start your search:\nClick the\nSearch assets across Atlan\nbar on the homepage.\nClick\nAssets\nin the left-side panel.\nUse\nCmd/Ctrl + K\nto open the search page from\nanywhere\nin Atlan.\nSearch using context\nâ\nThe\nAssets\nsection offers a\nvariety of filters\nto narrow down your search. Here are the different types of filters that you can use:\nSource\n: Search by\nconnectors\n, chosen from a list of connections within Atlan.\nDomains\n: Filter assets by\ndomains\n, such as a single domain, multiple domains, or no domain.\nCertificate\n: Search based on the certificate attached to data assets, such as\nVerified\n,\nDraft\n,\nDeprecated\n, and\nNo certificate\n.\nOwners\n: Filter by selecting one or more users. You can also toggle between\nusers\nand\ngroups\nÂ to filter based on a group of users.\nTags\n: Filter by user-generated tags, such as\npublic\n,\nPII\n, and more.\nTerms\n: Filter by terms from your glossaries, such as\ncost\n,\nrevenue\n, or\nP&L\n.\nProperties\n: Filter assets by other properties, like technical name or\nalias\n,\ndescription\n, last updated, and so on.\nAtlan's search results include a quick count of all the resulting data assets grouped by type. As you apply the filters, you'll see these counts change in real time.\nYou can also enter a keyword in the search bar and filter your results by a specific type of data asset. For instance, enter the keyword\norder\nin the search bar and then click the\nColumn\ncheckbox to view column results for your searched keyword.\nSort search results\nâ\nAtlan allows you to sort your search results in different ways. This helps you quickly find the assets you're interested in. Sorting options include:\nRelevance\n: Sort by how closely the search results match your searched keywords.\nName\n: Sort by the asset name in an alphabetical or a reverse alphabetical order.\nUpdated on Atlan\n: Sort by the newest or oldest updated assets.\nStar count\n: SortÂ assets by\nmost or fewest stars\n.\nOrder\n: Sort the search results in an ascending or descending order.\nPopularity\n: Sort Snowflake and Google BigQuery assets by the\nmost or least popular assets\n.\nDid you know?\nThe sorting options may vary depending on the asset type selected. For example, if you are viewing the results while filtering by the\nTable\ntab, you'll also have the option of sorting by the most or fewest number of rows and columns.\nSearch with patterns\nâ\nYou can refine your search in Atlan with the following patterns:\nExact match search\n: Wrap the keywords within single\n''\nor double\n\"\"\nquotation marks when typing them in the search bar   -  for example,\n\"instacart_total_users\"\n. Only the asset names with case-insensitive exact match and following the order of the keywords will be boosted in the search results   -  for example,\ninstacart_total_users\nor\nInstacart_Total_Users\n. If the keywords are contained in the\nasset description\nor\nlinked terms\n, such assets will show up next. Additionally, you can use exact match to search by the\nqualifiedName\nor globally unique identifier (GUID) of an asset.\nCombined string of database, schema, and table\n: For a more data-friendly search experience, copy the combined string of\ndatabase.schema.table\n(or\nschema.table\n) from your SQL editor and paste it in the search bar   -  for example,\natlan_db.public.instacart_total_orders\n.\nMultiple phrase match\n: When you enter two or more keywords, Atlan will find assets with asset names that partially match the keywords or a combination of them to narrow down the search results.\nSee only what you want to see\nâ\nAtlan gives you the option to customize your search. Want to show or hide certain fields in your search results? Click the\n3-dot\nicon next to the search bar to set display preferences for each field:\nDescription\nTerms\nTags\nConnection\nSearch superpowers",
  "source_type": "docs"
}