{
  "source_url": "product_integrations_automation_browser-extension_how-tos_configure-the-extension-for-managed-browsers.html",
  "text": "Configure the extension for managed browsers | Atlan Documentation\nSkip to main content\nOn this page\nIf you're using managed browsers, you can install and configure the Atlan browser extension for all users in your organization. To do so, you will need to bulk install the extension and deploy a configuration script.\nAtlan supports managing the Atlan browser extension for the following:\nOperating systems: macOS and Microsoft Windows\nBrowsers: Google Chrome and Microsoft Edge\nThe deployment scripts   -  .mobileconfig file for macOS and PowerShell script for Microsoft Windows   -  are designed to make only the most necessary modifications required for the Atlan browser extension to function properly. Both deployment methods adhere to the principle of least privilege:\nThe .mobileconfig file for macOS only includes the configuration settings required to install and operate the Atlan browser extension.\nThe PowerShell script creates essential registry keys required for the Atlan browser extension to operate on Microsoft Windows systems.\nTo configure the Atlan browser extension for a managed browser, you must complete these steps in the following order:\nConfigure the browser extension\nBulk install the browser extension\nDeploy the configuration script\n(Optional)\nVerify and monitor the installation\nConfigure the browser extension\nâ\nWho can do this?\nYou will need to be an\nadmin\nin Atlan to configure the browser extension for users in your organization. You will also need inputs and approval from the IT administrator of your organization.\nYou can configure the browser extension and then download a configuration script to bulk install and deploy it for everyone in your organization.\nTo configure the browser extension, from within Atlan:\nFrom the left menu on any screen, click\nAdmin\n.\nUnder\nWorkspace\n, click\nIntegrations\n.\nUnder\nApps\n, expand the\nBrowser extension\ntile.\nIn theÂ\nBrowser extension\ntile, for\nBulk install the browser extension\n, click the\nSet up now\nbutton.\nIn the\nSet up browser extension\nform, enter the following details:\nFor\nChoose browser\n, the browser and operating system values will be prefilled based on what you're currently using   -  you can modify the fields, if required.\nFor\nYour\nAtlan domain\n, enter the URL of your Atlan instance   -  for example,\nhttps://(instance_name).atlan.com\n.\ninfo\nðª\nDid you know?\nIf you enable multiple Atlan domains, your users will be able to select the most relevant Atlan domain from a dropdown menu while using the browser extension. The default value in the dropdown will be the Atlan instance entered as\nYour Atlan domain\n. If your organization does not have multiple Atlan domains, only the default selection will be displayed.\n(Optional) For\nAdvanced settings\n, you can configure the following:\nIf you have multiple Atlan instances, toggle on\nMultiple Atlan domains\nand then enter the URLs of your additional Atlan instances. Click\n+\nAdd\nto add more Atlan domains.\nIf your data tools are hosted on custom domains rather than the standard SaaS domain of each tool, toggle on\nCustom data source\ndomain\n. Click\n+ Add\nÂ to add more custom domains for data sources.\nFor\nConnector\n, select a\nsupported tool\nfor the browser extension.\nIn the adjacent field, enter the URL of your custom data source domain.\ninfo\nðª\nDid you know?\nFor any\nsupported tools\nconfigured while setting up the managed browser extension, your users will not be able to update or remove these selections. They can, however, add additional custom domains for data sources.\nClick the\nDownload Script\nbutton to download the corresponding configuration script. The IT administrator(s) in your organization will need to install this configuration file in your organization's devices using a mobile device management (MDM) software. Administrative permissions to the MDM platform are required to complete the setup. Based on your operating system, the downloaded file can be one of the following two types:\n.mobileconfig\n-  use this file to configure profiles with specific settings in\nmacOS devices\n.\n.ps1\n-  use this PowerShell script to create registry keys in\nMicrosoft Windows devices\n.\nBulk install the browser extension\nâ\nWho can do this?\nYou will need to have administrator access to your organization's mobile device management (MDM) software with the permission to add and deploy new policies to all users. You will also need inputs and approval from your Atlan admin.\nYou will need to configure the\nExtensionInstallForcelist\nbrowser policy for either Google Chrome or Microsoft Edge to force-install the extension for everyone in your organization.\nThe\nExtensionInstallForcelist\nbrowser policy:\nGoverns extensions that can be silently installed and automatically enabled for all users.\nProvides extension IDs that the browser will automatically install and enable when a user logs in.\nGoogle Chrome\nâ\nTo bulk install the Atlan browser extension in Google Chrome, follow the steps in Google documentation:\nForce install apps and extensions\n.\nMicrosoft Edge\nâ\nTo bulk install the Atlan browser extension in Microsoft Edge, follow the steps in Microsoft documentation:\nForce-install an extension\n.\nFor the\nExtension/App IDs and update URLs to be silently installed (Device)\nfield, copy and paste the following value:\nfipjfjlalpnbejlmmpfnmlkadjgaaheg;https://clients2.google.com/service/update2/crx\nfipjfjlalpnbejlmmpfnmlkadjgaaheg\nis the\nextension-id\nfor the Atlan browser extension.\nhttps://clients2.google.com/service/update2/crx\nindicates that it needs to be installed from the Chrome Web Store.\nDeploy the configuration script\nâ\nWho can do this?\nYou will need to have administrator access to your organization's mobile device management (MDM) software with the permission to add and deploy new policies to all users. You will also need inputs and approval from your Atlan admin.\nThe browser extension relies on managed storage for configuring domains in the Atlan extension. The values for managed storage can be configured through:\nA configuration profile in macOS\nRegistry keys in Microsoft Windows\nAlthough Atlan's solution is platform-agnostic, the following example pertains to\nMicrosoft Intune\n.\nmacOS\nâ\nYou will need to create a custom managed profile to configure the domains for the Atlan browser extension.\nTo deploy the\n.mobileconfig\nfile for your organization, you can use any MDM platform.\nFor example:\nMicrosoft Intune   -  follow the steps in\nCustom configuration profile settings\n.\nMicrosoft Windows\nâ\nYou will need to create registry keys to deploy the extension. You can create the required registry keys with a PowerShell script, which can then be deployed to your usersâ devices using an MDM software.\nTo deploy the PowerShell configuration script for your organization, you can use any MDM platform.\nFor example:\nMicrosoft Intune   -  follow the steps in\nCreate a script policy and assign it\n. For\nScript settings\n, enter the following details:\nScript location\n-  upload the\n.ps1\nconfiguration script downloaded from Atlan.\nRun this script using the logged on credentials\n-  change to\nNo\n.\nEnforce script signature check\nÂ   -  change to\nNo\n.\nRun script in 64 bit PowerShell Host\nÂ   -  change to\nYes\n.\nVerify and monitor the installation\nâ\nTo ensure that the Atlan browser extension has been successfully deployed across all selected devices in your organization, you can:\nVerify the installation   -  after you have deployed the policies, check a few target devices to ensure that the extension was installed and configured correctly.\nMonitor compliance   -  monitor the compliance status of the policy and troubleshoot any issues.\nYour users will now be able to use the Atlan browser extension in a managed browser! ð\nOnce the managed browser has synced with the latest configuration changes for your organization, the Atlan browser extension will be automatically installed and a new tab will open to indicate that the Atlan browser extension is now active.\nConfigure the browser extension\nBulk install the browser extension\nDeploy the configuration script\nVerify and monitor the installation",
  "source_type": "docs"
}