{
  "source_url": "sdks_go.html",
  "text": "Go SDK - Developer\nSkip to content\nGo SDK\n¶\nObtain the SDK\n¶\nPre-release state\nThe Go SDK is currently in a pre-release, experimental state. While in this state, we reserve the right to make any changes to it (including breaking changes) without worrying about backwards compatibility, semantic versioning, and so on.\nIf you are eager to experiment with it, it is available on\nGitHub\n. You can use Go dependencies to install it directly from there.\nWe welcome your feedback during the pre-release, but cannot commit to any specific revisions or timelines at this point in time.\nConfigure the SDK\n¶\nThere are two ways to configure the\nSDK:\nUsing environment variables\n¶\nATLAN_API_KEY\nshould be given your Atlan\nAPI token\n, for authentication (\ndon't forget to assign one or more personas to the API token to give access to existing assets!\n)\nATLAN_BASE_URL\nshould be given your Atlan URL (for example,\nhttps://tenant.atlan.com\n)\nHere's an example of setting those environment variables:\nSet environment variables\nexport ATLAN_BASE_URL=https://tenant.atlan.com\nexport ATLAN_API_KEY=\"...\"\nmain.go\n1\n2\n3\n4\n5\n6\n7\n8\n9\npackage\nmain\nimport\n(\n\"github.com/atlanhq/atlan-go/atlan/assets\"\n)\nfunc\nmain\n()\n{\nctx\n:=\nassets\n.\nNewContext\n()\n}\nOn client creation\n¶\nIf you prefer to not use environment variables, you can do the following:\nmain.go\n1\n2\n3\n4\n5\n6\n7\n8\n9\npackage\nmain\nimport\n(\n\"github.com/atlanhq/atlan-go/atlan/assets\"\n)\nfunc\nmain\n()\n{\nctx\n,\n_\n:=\nassets\n.\nContext\n(\n\"https://tenant.atlan.com\"\n,\n\"...\"\n)\n}\nCareful not to expose your API token!\nWe generally discourage including your API token directly in your code, in case you accidentally commit it into a (public) version control system. But it's your choice exactly how you manage the API token and including it for use within the client.\nThat's it — once these are set you can start using your SDK to make live calls against your Atlan instance! 🎉\nWhat's next?\n¶\nDelve into more detailed examples:\nCommon tasks\nCommon operations on assets, that are available across all assets.\nDiscover actions\nAsset-specific\nOperations that are specific to certain assets.\nFocus on a specific kind of asset\nGovernance structures\nOperations dealing with governance structures, rather than assets.\nManage governance structures\nSamples\nReal code samples our customers use to solve particular use cases.\nReview live samples\nSearching\nDelve deep into searching and aggregating metadata.\nLearn more about searching\nEvents\nDelve deep into the details of the events Atlan triggers.\nLearn more about events\nError-handling\n¶\nThe SDK defines exceptions for the following categories of error:\nException\nDescription\nApiConnectionError\nErrors when the SDK is unable to connect to the API, for example due to a lack of network access or timeouts.\nAuthenticationError\nErrors when the API token configured for the SDK is invalid or expired.\nConflictError\nErrors when there is some conflict with an existing\nasset\nand the operation cannot be completed as a result.\nInvalidRequestError\nErrors when the request sent to Atlan does not match its expectations. If you are using the built-in methods like\ntoCreate()\nand\ntoUpdate()\nthis exception should be treated as a bug in the SDK. (These operations take responsibility for avoiding this error.)\nLogicError\nErrors where some assumption made in the SDK's code is proven incorrect. If ever raised, they should be reported as bugs against the SDK.\nNotFoundError\nErrors when the requested resource or\nasset\ndoes not exist in Atlan.\nPermissionError\nErrors when the API token used by the SDK does not have permission to access a resource or carry out an operation on a specific\nasset\n.\nRateLimitError\nErrors when the Atlan server is being overwhelmed by requests.\nA given API call could fail due to all of the errors above. So these all extend a generic\nAtlanError\nexception, and all API operations can potentially raise\nAtlanError\n.\nExample\nFor example, when creating a connection there is an asynchronous process that grants permissions to the admins of that connection. So there can be a slight delay between creating the connection and being permitted to do any operations with the connection. During that delay, any attempt to interact with the connection will result in a\nPermissionError\n, even if your API token was used to create connection in the first place.\nAnother example you may occasionally hit is some network issue that causes your connection to Atlan to be interrupted. In these cases, an\nApiConnectionError\nwill be raised.\nAdvanced configuration\n¶\nAtlan is a distributed, cloud-native application, where network problems can arise. The SDK therefore automatically attempts to handle ephemeral problems.\nLogging\n¶\nThe SDK uses the\nslog\nlibrary internally to provide a flexible framework for emitting log messages.\nGo\nYou can enable logging for your SDK script by adding the following lines above your snippets:\nmain.go\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\npackage\nmain\nimport\n(\n\"github.com/atlanhq/atlan-go/atlan/assets\"\n)\nfunc\nmain\n()\n{\nctx\n:=\nassets\n.\nNewContext\n()\nctx\n.\nSetLogger\n(\ntrue\n,\n\"debug\"\n)\n// (1)!\n}\nYou can enable logging by using\n.SetLogger()\non the context object with various logging levels:\n\"debug\"\n: used to give detailed information, typically of interest only when diagnosing problems (mostly used level in SDK).\n\"info\"\n: used to confirm that things are working as expected.\n\"warn\"\n: used as an indication that something unexpected happened, or as a warning of some problem in the near future.\n\"error\"\n: indicates that due to a more serious problem, the SDK has not been able to perform some operation.\n2024-06-11\n2024-11-25\nWas this page helpful?\nThanks for your feedback!\nThanks for your feedback! Help us improve this page by using our\nfeedback form\nto provide us with more information.\nBack to top\nCookie consent\nWe use cookies to:\nAnonymously measure page views, and\nAllow you to give us one-click feedback on any page.\nWe do\nnot\ncollect or store:\nAny personally identifiable information.\nAny information for any (re)marketing purposes.\nWith your consent, you're helping us to make our documentation better 💙\nGoogle Analytics\nAccept\nReject\nManage settings",
  "source_type": "sdk"
}