{
  "source_url": "snippets_common-examples_glossary.html",
  "text": "Glossary introduction - Developer\nSkip to content\nGlossary introduction\n¶\nOperations on glossary assets (glossaries, categories, terms).\nGlossaries are a container for both terms and categories\nTerms and categories can only exist within a glossary. So a glossary must first exist, before you can create a term or category. This also means that if you delete a glossary, all of the terms and categories within that glossary are also deleted.\nNote as well that terms are\nnot\ncontained within categories. Categories are simply a mechanism to organize terms in Atlan. This means that deleting a category will\nnot\ndelete the terms related to it.\nerDiagram\nGlossary ||--o{ GlossaryCategory : contains\nGlossary ||--o{ GlossaryTerm : contains\nEach glossary object\nmostly\nbehaves like other assets in Atlan. You can\ncreate\n,\nretrieve\n,\nupdate\n,\ndelete\n,\nrestore\n,\nview history\n,\nsearch\n, and\ncombine operations\nusing the same patterns as for any other asset.\nUnique characteristics of glossary objects\nThere are, however, a few points that are unique to glossary objects compared to other asset types:\nThe\nqualifiedNames\nof all glossary objects are a hashed string. This is not human-readable. All other asset types have qualifiedNames that are human-readable. We have provided\nhelper methods\nspecifically for retrieval of glossary assets by their human-readable names.\nWhen\nupdating\na contained glossary object (term or category), you must provide details about the parent glossary of that object. You can update all other asset types without re-specifying their parent object.\nAs a result, the\ncreator()\nand\nupdater()\nbuilder methods for terms and categories require extra parameters to specify the glossary.\nThe other difference that exists in interacting with glossaries is the common need to\ntraverse\ntheir hierarchy of categories.\n2022-12-02\n2024-10-01\nWas this page helpful?\nThanks for your feedback!\nThanks for your feedback! Help us improve this page by using our\nfeedback form\nto provide us with more information.\nBack to top\nCookie consent\nWe use cookies to:\nAnonymously measure page views, and\nAllow you to give us one-click feedback on any page.\nWe do\nnot\ncollect or store:\nAny personally identifiable information.\nAny information for any (re)marketing purposes.\nWith your consent, you're helping us to make our documentation better 💙\nGoogle Analytics\nAccept\nReject\nManage settings",
  "source_type": "sdk"
}