{
  "source_url": "support_references_customer-support.html",
  "text": "Customer support | Atlan Documentation\nSkip to main content\nOn this page\nOne of Atlan's core values is to help you and your team do your life's best work. ð\nThat's why Atlan wants to make it as easy as possible for you to keep driving your work forward with data.\nAtlan's customer support is a combination of several teams in Atlan:\nProduct support personnel\nCloud support personnel\nDevOps/engineering support personnel\nVast repository of self-service resources\nService-level commitment\nâ\nAtlan's Technical Support team provides support globally with high response commitment levels. This includes 24/7 SRE support for critical (P0) issues. Customers get a service-level commitment, including the following:\n99.5% uptime for Atlan\nDedicated support center, available from within the Atlan product\nCommitments for aggressive response times for business critical issues\nDesignated Customer Success Manager to assist with escalations\nWays to contact support\nâ\nâï¸ Email support at a dedicated customer support email account (\n[email protected]\n)\nð¨âð» In-product support widget to log tickets and a\nhelp desk portal\nto log and track tickets. You can sign up to\ntrack support tickets\non the help desk portal. You must use your organizational email address as the username and create a password.\nð\nSubmit a support request\nvia the online form.\nTo track your support tickets:\nNavigate to\nhttps://atlan.zendesk.com\nand log into the help desk portal with your credentials or via SSO.\nFrom the top right, click your avatar, and then from the dropdown, click\nMy activities\n.\nOn the\nMy activities\npage, you can do the following:\nMy requests\nand\nRequests I'm CC'd on\n-  view and edit the support tickets you either created or were copied on, respectively.\nOrganization requests\n-  to access all other support tickets for your organization, please reach out to your customer success manager. Atlan provides you with read access to all the support tickets for your organization. To be able to comment on or close them, you must be CC'd on all tickets.\nHours of operation\nâ\n24x7 availability for all requests and issues\nSeverity levels\nâ\nThe AtlanÂ Technical Support team determines the severity of an issue. The customer's position is considered, and these guidelines are followed to determine priority. Below are the response time SLAs:\nSeverity\nDescription\nBasic support\nAdvanced support\nS0\nProduction software is unavailable; all customers are blocked and productivity halted\n2 hours\n1 hour\nS1\nProduction software is available; functionality or performance is severely impaired\n4 hours\n2 hours\nS2\nProduction software is available and usable with partial, noncritical loss of functionality. Or, production software has an occasional issue that customer requests identification and resolution. Also includes requests for help with administrative tasks\n16 hours\n4 hours\nS3\nCosmetic issues or request for general information about the software, documentation, processes, or procedures\n24 hours\n14 hours\nEscalation procedure\nâ\nIf the business impact of a support request changes or a ticket isn't being handled according to your expectations, you may escalate the ticket.\nPlease first speak with the Technical Support representative assigned to the ticket to confirm that the business impact and urgency are understood.\nYou may further escalate by contacting:\n1st level of escalation\n: Technical Support Engineer\n2nd level of escalation\n: Director, Support\n3rd level of escalation\n: Head of Customer Experience\nService-level commitment\nWays to contact support\nHours of operation\nSeverity levels\nEscalation procedure",
  "source_type": "docs"
}