{
  "source_url": "tags_authentication.html",
  "text": "53 docs tagged with \"authentication\" | Atlan Documentation\nSkip to main content\nAdd impact analysis in GitHub\nLearn about add impact analysis in github.\nAdd impact analysis in GitLab\nLearn about add impact analysis in gitlab.\nAuthentication\nUnderstand how Secure Agent 2.0 authentication works and why it protects your enterprise infrastructure.\nCreate an AWS Lambda trigger\nOnce you have configured the [AWS Lambda permissions](/product/integrations/automation/aws-lambda/how-tos/set-up-aws-lambda), you can run an AWS Lambda function.\nEnable  Snowflake OAuth\nAtlan supports [Snowflake OAuth-based authentication](https://docs.snowflake.com/user-guide/oauth-snowflake-overview) for [Snowflake](/apps/connectors/data-ware.\nEnable  SSO for Amazon Redshift\nYou will need to [create a client application in Okta](https://help.okta.com/en-us/Content/Topics/Apps/Apps_App_Integration_Wizard_OIDC.htm) to use for [configuring the identity provider in AWS](/apps/connectors/data-warehouses/amazon-redshift/how-tos/enable-sso-for-amazon-redshift).\nEnable  SSO for Google BigQuery\nCredentials are used to obtain an access token from Google's authorization servers for authentication in Atlan.\nextract lineage and usage from Databricks\nOnce you have [crawled assets from Databricks](/apps/connectors/data-warehouses/databricks/how-tos/crawl-databricks), you can retrieve lineage from [Unity Catalog](https://docs.databricks.com/data-governance/unity-catalog/index.html) and [usage and popularity metrics](/product/capabilities/usage-and-popularity/how-tos/interpret-usage-metrics) from [query history](https://docs.databricks.com/api/workspace/queryhistory/list) or system tables. This is supported for all [three authentication methods](/apps/connectors/data-warehouses/databricks/how-tos/set-up-databricks): personal access token, AWS service principal, and Azure service principal.\nIntegrate Anomalo\nOnce you have [configured the Anomalo settings](/apps/connectors/observability/anomalo/how-tos/set-up-anomalo), you can establish a connection between Atlan and Anomalo.\nIntegrate Apache Spark/OpenLineage\nAtlan extracts job-level operational metadata from Apache Spark and generates job lineage through OpenLineage. To learn more about OpenLineage, refer to [OpenLineage configuration and facets](/product/connections/references/openlineage-configuration-and-facets).\nPingFederate SSO 404 error\nIf you're encountering a 404 error while using PingFederate single sign-on (SSO), it is possible that the authentication request requires a signed assertion.\nPreflight checks for Google BigQuery\nEach request requires an OAuth 2.0 access token generated via the [service account key](https://cloud.google.com/docs/authentication#service-accounts).\nPreflight checks for Microsoft Azure Synapse Analytics\nThis check is performed for both [basic](/apps/connectors/data-warehouses/microsoft-azure-synapse-analytics/how-tos/set-up-microsoft-azure-synapse-analytics) and [service principal](/apps/connectors/data-warehouses/microsoft-azure-synapse-analytics/how-tos/set-up-microsoft-azure-synapse-analytics) authentication method.\nSecurity\nThe Secure Agent is designed with multiple security controls to protect metadata, credentials, and communication between systems. This document outlines its security mechanisms across authentication, encryption, container security, network security, and logging and monitoring.\nSecurity and Compliance\nComplete guide to Atlan's security features, compliance certifications, and data protection capabilities.\nSet up Amazon DynamoDB\nLearn about set up amazon dynamodb.\nSet up Amazon MSK\nLearn about set up amazon msk.\nSet up Amazon QuickSight\nLearn about set up amazon quicksight.\nSet up Amazon Redshift\n:::warning Who can do this? You will need your Amazon Redshift administrator to run these commands - you may not have access yourself.\nSet up Anomalo\nAtlan supports the API authentication method for fetching metadata from [Anomalo](https://docs.anomalo.com/integrations/atlan-integration). This method uses an API key to fetch metadata.\nSet up client credentials flow\nConfigure Salesforce for OAuth 2.0 client credentials authentication in Atlan.\nSet up Confluent Kafka\nAtlan supports the API authentication method for fetching metadata from Confluent Kafka. This method uses an API key and API secret to fetch metadata.\nSet up Confluent Schema Registry\n:::warning Who can do this? You will probably need your Schema Registry administrator to complete these steps - you may not have access yourself.\nSet up Databricks\nAtlan supports three authentication methods for fetching metadata from Databricks. You can set up any of the following authentication methods:.\nSet up Domo\n:::warning Who can do this? You will need your Domo administrator to complete these steps - you may not have access yourself.\nSet up Hive\n:::warning Who can do this? You will need your Hadoop administrator to run these commands - you may not have access yourself.\nSet up IBM Cognos Analytics\n:::warning Who can do this? You must be an IBM Cognos Analytics administrator to complete these steps - you may not have access yourself.\nSet up Informatica CDI\nConfigure authentication and user permissions for Informatica Cloud Data Integration connector\nSet up JWT bearer flow\nConfigure Salesforce for OAuth 2.0 JWT bearer authentication for Atlan.\nSet up Microsoft Azure Cosmos DB\nIf your Microsoft Azure Cosmos DB deployment includes a mix of vCore- and RU-based accounts, you must configure both to fetch metadata. You can then use the _vCore and RU_ deployment option to [crawl your Microsoft Azure Cosmos DB assets](/apps/connectors/database/microsoft-azure-cosmos-db/how-tos/crawl-microsoft-azure-cosmos-db).\nSet up Microsoft Azure Data Factory\nAtlan supports service principal authentication for fetching metadata from Microsoft Azure Data Factory. This method requires a client ID, client secret, and tenant ID to fetch metadata.\nSet up Microsoft Azure Event Hubs\nAtlan supports the following authentication methods for Microsoft Azure Event Hubs:.\nSet up Microsoft Azure Synapse Analytics\nAtlan supports crawling the following with the Microsoft Azure Synapse Analytics package:.\nSet up Microsoft Power BI\nThis guide outlines how to set up Microsoft Power BI so it can connect with Atlan for metadata extraction and lineage tracking.\nSet up Microsoft SQL Server\n:::warning Who can do this? You will probably need your Microsoft SQL Server administrator to run these commands - you may not have access yourself.\nSet up MicroStrategy\nAtlan supports the basic authentication method for fetching metadata from MicroStrategy. This method uses a username and password to fetch metadata.\nSet up MongoDB\nAtlan supports the basic authentication method for fetching metadata from MongoDB. This method uses a [username and password](#create-database-user-in-mongodb) to fetch metadata.\nSet up Monte Carlo\n:::warning Who can do this? You will probably need your Monte Carlo [account owner](https://docs.getmontecarlo.com/docs/authorizationmanaged-roles-and-groups).\nSet up MySQL\n:::warning Who can do this? You will probably need your MySQL administrator to run these commands - you may not have access yourself.\nSet up Oracle\n:::warning Who can do this? You need your Oracle database administrator or a similar role to run these commands - you may not have access yourself.\nSet up PrestoSQL\nLearn about set up prestosql.\nSet up Redash\n:::warning Who can do this? You will probably need your Redash administrator to complete the following steps - you may not have access yourself.\nSet up Salesforce\nLearn about setting up Salesforce authentication for Atlan.\nSet up SAP HANA\n:::warning Who can do this? You will probably need your SAP HANA administrator to run these commands - you may not have access yourself.\nSet up Sisense\nAtlan supports the basic authentication method for fetching metadata from Sisense. This method uses a username and password to fetch metadata.\nSet up Soda\n:::warning Who can do this? You will need your [Soda Cloud administrator](https://docs.soda.io/soda-cloud/roles-and-rights.html) to complete these steps -.\nSet up Teradata\n:::warning Who can do this? You will probably need your Teradata administrator to run these commands - you may not have access yourself.\nSet up ThoughtSpot\n:::warning Who can do this? You will probably need your ThoughtSpot instance administrator to complete these steps - you may not have access yourself.\nSet up Trino\n:::warning Who can do this? You will probably need your Trino administrator to run these commands - you may not have access yourself.\nSet up username-password flow\nConfigure Salesforce username-password flow for Atlan integration.\nSupported connections for on-premises databases\nThe metadata-extractor tool supports the following connection types.\nUsers and groups\nLearn how to manage users and groups in Atlan to control access and organize your data team.\nWhat does Atlan crawl from Domo?\nAtlan supports lineage for the following asset types:.",
  "source_type": "docs"
}