{
  "source_url": "tags_security.html",
  "text": "24 docs tagged with \"security\" | Atlan Documentation\nSkip to main content\nAccess Control\nLearn how to manage user permissions and access to data assets in Atlan for security and compliance.\nAtlan architecture\nLearn about atlan architecture.\nAtlan browser extension security\nLearn about atlan browser extension security.\nBigID\nIntegrate with BigID and enrich assets in Atlan with BigID-discovered privacy metadata.\nCloud logging and monitoring\nLearn about Atlan's Cloud logging and monitoring exported in OpenTelemetry Protocol (OTLP) format for SIEM integration and security monitoring.\nCompliance standards and assessments\nLearn about compliance standards and assessments.\nConfigure network security\nConfigure firewall rules and network policies to secure communication between Secure Agent 2.0 and Atlan services\nCustomer environment security\nCustomer environment security best practices for deploying and operating Secure Agent 2.0\nDeployment and security\nFrequently asked questions about Secure Agent 2.0 deployment and security\nDeployment architecture\nThe Atlan Secure Agent is a Kubernetes-based application that runs within a customer's environment. It acts as a gateway between the single-tenant Atlan SaaS and external systems like Snowflake, Tableau, and other data sources. This document explains the Secure Agent's deployment architecture, key components, communication flows, and security considerations.\nEncryption and key management\nLearn about encryption and key management.\nIncident response plan\nLearn about incident response plan.\nInfrastructure security\nLearn about infrastructure security.\nInstall on AWS EKS\nThis guide provides step-by-step instructions to install the Secure Agent on an Amazon Elastic Kubernetes Service (AWS EKS) cluster.\nManage user authentication\nWhen users log into Atlan, a user session begins. You can change the default timeouts for user sessions for all users in your organization, helping you establish secure authentication protocols in Atlan. Once you have configured the settings, these would be applicable to users logging in via both basic and SSO authentication.\nMicrosoft Defender SSO error\nLearn about unable to log into atlan via sso due to an \"internal error\" from microsoft defender.\nRoles and permissions\nExplanation of Snowflake's security model and role requirements for data quality operations.\nSecure Agent\nThe Atlan Secure Agent is a lightweight, Kubernetes-based application that enables secure metadata extraction. It connects internal systems with Atlan SaaS while keeping sensitive data protected and doesn’t require inbound connectivity. Running within an organization’s controlled environment, the Secure Agent ensures compliance with security policies and automates metadata processing.\nSecurity\nSecurity overview and controls for Secure Agent 2.0\nSecurity monitoring\nLearn about security monitoring.\nSet up on-premises Databricks lineage extraction\nIn some cases you will not be able to expose your Databricks instance for Atlan to extract and ingest lineage. For example, this may happen when security requirements restrict access to sensitive, mission-critical data.\nTroubleshooting Salesforce connectivity\nLearn about troubleshooting salesforce connectivity.\nTroubleshooting ServiceNow\nWhy is the security\\_admin role required to complete the ServiceNow integration?\nVerify container images\nVerify the authenticity and integrity of Secure Agent container images with Cosign",
  "source_type": "docs"
}