[
  {
    "content": "Documentation conventions - Developer\nSkip to content\nDocumentation conventions\n¶\nWe use icons to quickly convey contextual details about features illustrated in code. Following is the complete list of such icons and their meaning:\nx.y.z\nAtlan CLI version\n¶\nThe terminal symbol in conjunction with a version number denotes when a specific feature or behavior was added to the Atlan CLI. Make sure you're at least on this version if you want to use it the way it is illustrated in any code blocks.\nx.y.z\nJava SDK version\n¶\nThe Java symbol in conjunction with a version number denotes when a specific feature or behavior was added to the Java SDK. Make sure you're at least on this version if you want to use it the way it is illustrated in any code blocks.\nAlso applies to Kotlin\nSince the Java SDK is also used for Kotlin, the same minimum version requirement applies to any Kotlin functionality and code blocks as well.\nx.y.z\nPython SDK version\n¶\nThe Python symbol in conjunction with a version number denotes when a specific feature or behavior was added to the Python SDK. Make sure you're at least on this version if you want to use it the way it is illustrated in any code blocks.\nx.y.z",
    "metadata": {
      "source_url": "conventions.html",
      "source_type": "sdk",
      "file": "conventions.json",
      "chunk_id": 0
    }
  },
  {
    "content": "x.y.z\nGo SDK version\n¶\nThe Go symbol in conjunction with a version number denotes when a specific feature or behavior was added to the Go SDK. Make sure you're at least on this version if you want to use it the way it is illustrated in any code blocks.\nExperimental features\n¶\nSome newer features are still considered experimental. These will be clearly marked as such here in\ndeveloper.atlan.com\n, as well as in the release notes for the SDK version where they are introduced.\nSubject to change\nPlease note that experimental features are subject to change prior to their final form. Such changes will not cause a change to the major version of the SDK.\nConversely, for any feature not marked experimental, we aim ensure no breaking changes are made to it without incrementing the major version of the SDK.\n2023-10-18\n2024-06-11\nWas this page helpful?\nThanks for your feedback!\nThanks for your feedback! Help us improve this page by using our\nfeedback form\nto provide us with more information.\nBack to top\nCookie consent\nWe use cookies to:\nAnonymously measure page views, and\nAllow you to give us one-click feedback on any page.\nWe do\nnot\ncollect or store:\nAny personally identifiable information.",
    "metadata": {
      "source_url": "conventions.html",
      "source_type": "sdk",
      "file": "conventions.json",
      "chunk_id": 1
    }
  },
  {
    "content": "Cookie consent\nWe use cookies to:\nAnonymously measure page views, and\nAllow you to give us one-click feedback on any page.\nWe do\nnot\ncollect or store:\nAny personally identifiable information.\nAny information for any (re)marketing purposes.\nWith your consent, you're helping us to make our documentation better 💙\nGoogle Analytics\nAccept\nReject\nManage settings",
    "metadata": {
      "source_url": "conventions.html",
      "source_type": "sdk",
      "file": "conventions.json",
      "chunk_id": 2
    }
  }
]