[
  {
    "content": "How are product updates deployed? | Atlan Documentation\nSkip to main content\nOn this page\nAs the control plane for your entire data stack, Atlan's product release strategy is centered on being fast, iterative, and adaptive to the needs of our partners. All the while ensuring that product releases are mature and stable to truly empower users.\nAtlan follows a standard CI/CD model   -  continuous integration (CI) and continuous delivery (CD)   -  for\ndeploying product updates\n. This includes bug fixes and making improvements regularly.Â\nTo minimize risks and enhance security, each component in Atlan is tracked and released individually. When developers make changes, a series of automated validations are initiated, including building component images, running tests, and verifying that no vulnerabilities have been introduced. Peer reviews further ensure high-quality standards.\nOnly after the changes have been approved, the new release will go through the following stages:\nStaging   -  for pre-production testing\nBeta   -  for limited user testing\nProduction   -  live environment release",
    "metadata": {
      "source_url": "get-started_faqs_how-are-product-updates-deployed.html",
      "source_type": "docs",
      "file": "get-started_faqs_how-are-product-updates-deployed.json",
      "chunk_id": 0
    }
  },
  {
    "content": "Staging   -  for pre-production testing\nBeta   -  for limited user testing\nProduction   -  live environment release\nAtlan's engineering team actively reviews any issues with new releases to extract valuable insights and learning opportunities toward offering a better service. Accordingly, Atlan recommends that any connections or integrations you would like to make must be approved by Atlan unless already tested and documented. Note that any unauthorized integration may lead to breakdown of service and impact end user experience.\nSignificant feature updates are always highlighted within the application. You can also subscribe to our\nShipped channel\nfor updates on product rollouts.\nView product updates\nâ\nTo view product updates in Atlan:\nFrom the top right of any screen in Atlan, click the\ngift box\nicon.Â\nIn the\nProduct Updates\nsidebar, view the latest product releases. You can also:\n(Optional) Click\nSubscribe\nto subscribe to our\nShipped channel\n.\n(Optional) Type a keyword in the search bar to search for specific product releases.\nView product updates",
    "metadata": {
      "source_url": "get-started_faqs_how-are-product-updates-deployed.html",
      "source_type": "docs",
      "file": "get-started_faqs_how-are-product-updates-deployed.json",
      "chunk_id": 1
    }
  }
]