[
  {
    "content": "Integrations | Atlan Documentation\nSkip to main content\nAtlan integrates with a wide range of tools to help you automate workflows, connect with your favorite apps, and manage identity and access. These integrations connect your data catalog with the tools your teams already use, creating a seamless data experience across your tech stack.\nKey concepts\n​\nIntegration categories\n: Atlan offers integrations across five categories: project management, communication, collaboration, automation, and identity management.\nConnection methods\n: Most integrations use secure authentication methods like OAuth, API keys, or service accounts.\nBi-directional sync\n: Updates flow between Atlan and integrated tools, ensuring data consistency across platforms.\nCustom webhooks\n: Extend Atlan's capabilities by building custom integrations using the provided APIs and webhooks.\nCore offerings\n​\n⚙️\nAutomation\nConnect with platforms like AWS Lambda to automate data workflows and streamline routine tasks.\n👥\nCollaboration\nIntegrate with tools like Slack and Microsoft Teams to enhance team collaboration and knowledge sharing.\n💬\nCommunication\nConnect with SMTP for real-time alerts.\n🔐",
    "metadata": {
      "source_url": "product_integrations.html",
      "source_type": "docs",
      "file": "product_integrations.json",
      "chunk_id": 0
    }
  },
  {
    "content": "👥\nCollaboration\nIntegrate with tools like Slack and Microsoft Teams to enhance team collaboration and knowledge sharing.\n💬\nCommunication\nConnect with SMTP for real-time alerts.\n🔐\nIdentity management\nIntegrate with identity providers like Okta and Azure AD for seamless authentication and user management.\n📋\nProject management\nConnect with tools like Jira and Service Now to link data assets to projects and track data-related tasks.\nGet started\n​\n1\nSelect an integration\nChoose from Atlan's available integrations based on your team's tools and workflows.\n→\n2\nConfigure connection\nFollow the integration-specific setup guide to establish a secure connection with your tool.\n→\n3\nTest and activate\nVerify the integration is working correctly with a test action, then activate for your organization.\n💡\nNeed a custom integration? Atlan provides APIs and webhooks that let you build custom integrations with any tool in your tech stack.",
    "metadata": {
      "source_url": "product_integrations.html",
      "source_type": "docs",
      "file": "product_integrations.json",
      "chunk_id": 1
    }
  }
]