[
  {
    "content": "20 docs tagged with \"data quality\" | Atlan Documentation\nSkip to main content\nAnomalo\nIntegrate, catalog, and govern Anomalo assets in Atlan.\nConfigure alerts\nSet up real-time notifications for data quality rule failures via Slack or Microsoft Teams.\nContracts\nLearn how to manage data contracts and agreements in Atlan to ensure data quality and compliance.\nData quality permissions\nReference for data quality permission scopes and configuration in Atlan.\nDatabricks Data Quality Studio\nSet up and configure Databricks for data quality monitoring through Atlan.\nEnable auto re-attachment of rules\nLearn how to enable automatic re-attachment of data quality rules to Snowflake tables and views.\nEnable data quality on connection\nEnable and configure data quality for your Databricks connection in Atlan.\nEnable data quality on connection\nEnable and configure data quality for your Snowflake connection in Atlan.\nMonte Carlo\nIntegrate, catalog, and govern Monte Carlo assets in Atlan.\nOperations\nAtlan crawls and manages the following data quality operations and results from Snowflake.\nRoles and permissions\nExplanation of Snowflake's security model and role requirements for data quality operations.",
    "metadata": {
      "source_url": "tags_data-quality.html",
      "source_type": "docs",
      "file": "tags_data-quality.json",
      "chunk_id": 0
    }
  },
  {
    "content": "Roles and permissions\nExplanation of Snowflake's security model and role requirements for data quality operations.\nRules and dimensions\nReference for available data quality rules and classification dimensions in Snowflake data quality.\nSet up Databricks\nConfigure Databricks to enable data quality monitoring through Atlan.\nSet up Snowflake\nConfigure Snowflake to enable data quality monitoring through Atlan.\nSetup and configuration\nCommon questions about Databricks data quality setup and configuration.\nSnowflake Data Quality Studio\nSet up and configure Snowflake for data quality monitoring through Atlan.\nSoda\nIntegrate, catalog, and govern Soda assets in Atlan.\nUpgrade to Snowflake data quality studio\nUpdate existing Snowflake data quality integration to the latest version\nWhat's auto re-attachment\nUnderstand automatic re-attachment of data quality rules to assets that are dropped and recreated.\nWhat's Data Quality Studio\nUnderstand Atlan's Data Quality Studio and how it enables business and data teams to collaborate on defining, monitoring, and enforcing data quality expectations",
    "metadata": {
      "source_url": "tags_data-quality.html",
      "source_type": "docs",
      "file": "tags_data-quality.json",
      "chunk_id": 1
    }
  }
]